<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Inertia\Inertia;
//หน้าที่ควบคุมข้อมูลและการแสดงproducts

class ProductController extends Controller
{
    //ข้อมูลของproducts
    private $products=[
        ['id' => 1, 'name' => 'เขมจิราต้องรอด',
        'description' => 'เขมเกิดขึ้นมาในครอบครัวต้องสาป ที่ว่าด้วยการให้กำเนิดบุตร
        หากเป็นบุตรสาวจะแคล้วคลาดปลอดภัย
        หากเป็นบุตรชาย ผู้นั้นต้องตกตายก่อนอายุยี่สิบปี
        มารดาตั้งชื่อเขมว่า ‘เขมจิรา’ ที่เป็นชื่อของหญิงสาวเพื่อแก้เคล็ด
        ‘เขมจิรา’ แปลว่าปลอดภัยตลอดกาล
        เขมเชื่อแบบนั้นจนกระทั่งวันเกิดอายุครบสิบเก้าปี...',
        'price' => 479,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/222874/Thumbnail/book_detail_large.gif?14'
        ],
        ['id' => 2, 'name' => 'Your Sky กี่หมื่นฟ้า',
        'description' => 'ได้ฉายา เมาแล้วขี้อ้อน มาจากเพื่อน ๆ ในตอนแรกคิดว่ามันเกินจริงไปนิด แต่คงไม่เกินไปแล้วแหละ เพราะครั้งนี้ที่รักเมาแล้วดันไปอ้อนขอให้รุ่นพี่หอมหัวตัวเอง...',
        'price' => 369,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/103686/Thumbnail/book_detail_large.gif?4'
        ],
        ['id' => 3, 'name' => 'How much is your love ? ',
        'description' => 'ถ้ากอดพี่ให้ห้าร้อย , จูบพี่ให้พันนึง , แต่ถ้าเป็นอย่างอื่นอะพี่ให้ครั้งละห้าพัน ไม่รับเงินจากที่อื่นด้วยนะ ตลกเถอะ!! ได้ข่าวผมติดหนี้พี่เป็นแสน!!... แต่ถ้าเป็นแฟนพี่ ยกหนี้ให้ฟรีเลยครับ ; )',
        'price' => 300,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/98527/Thumbnail/book_detail_large.gif?4'
        ],
        ['id' => 4, 'name' => 'ภูผาอาคมคุมขลัง(ขัง)',
        'description' => 'กูบอกให้มึงคลานเข่าเข้ามาหากู!! ถ้ามึงอยากรอดออกจากที่นี่ หึ!!',
        'price' => 249,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/237937/Thumbnail/book_detail_large.gif?8'
        ],
        ['id' => 5, 'name' =>  'CUPID IS ARROW หลบรักศรกามเทพ',
        'description' => 'อาถรรพ์ Cupid Writer ที่เอาคาแร็กเตอร์ใครมาแต่งนิยายเขาก็รักกันในชีวิตจริง แล้วนิยายเรื่องใหม่ที่ปลื้มต้องกลายเป็นนายเอกคู่กับเดือนคณะแพทย์คู่อริ ศรรักของคิวปิดที่แสนศักดิ์สิทธิ์จะทำให้เรารักกันได้ไหม',
        'price' => 439,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/223998/Thumbnail/book_detail_large.gif?14'
        ],
        ['id' => 6, 'name' => 'มนตร์น่านหนาว',
        'description' => 'น่านหนาว เด็กหนุ่มที่มองโลกนี้ด้วยความสดใสและหลงรักพ่อครูศรัณย์ มาตั้งแต่เด็ก ทว่าทำอย่างไรพ่อครูก็ไม่ยอมรับรัก จู่ ๆ วันหนึ่งโดนทำนายทายทักว่าจะมีอันเป็นไปเมื่ออายุครบ 25 ปีบริบูรณ์ และในวันเกิดวันนั้นน่านหนาวโดนรถชนเข้าที่ทางสามแพร่งอย่างจัง เหตุการณ์ได้ยินเสียงแว่วหลอนหูรวมถึงฝันร้ายในเรื่องเดิมซ้ำ ๆ  ตามหลอกหลอนจนพ่อครูศรัณย์ต้องยื่นมือเข้ามาช่วย',
        'price' => 279,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/287874/Thumbnail/book_detail_large.gif?8'
        ],
        ['id' => 7, 'name' => 'อุ่นไอของดิน',
        'description' => 'ชีวิตของอนลวนเวียนอยู่กับการเรียนและการทำงานหามรุ่งหามค่ำ ความรักจากครอบครัวเป็นอย่างไร เขาไม่เคยได้สัมผัส กระทั่งวันหนึ่งที่เขาได้พบกับ ‘คุณหนู’ ของบ้านที่เขาไปล้างรถให้ ตอนนั้นอนลไม่รู้เลยว่า นั่นคือจุดเริ่มต้นของลมเปลี่ยนทิศ ที่จะพาชีวิตเขาไปสู่ความสัมพันธ์ที่ไม่เคยพานพบมาก่อน

        ธรณินเคยคิดว่า อนลก็เป็นแค่เด็กคนหนึ่งที่สร้างสตอรีน่าสงสารให้คนอื่นเห็นใจ แต่หลังจากที่ได้รู้จัก ได้ใกล้ชิด ได้คอยดูแลในฐานะคุณหนูซึ่งเป็นนายจ้าง และรุ่นพี่ต่างคณะที่มหา’ลัย ความรู้สึกบางอย่างก็เข้าครอบงำหัวใจทีละน้อย หัวใจที่เคยคิดว่าตายไปแล้วเพราะเหตุการณ์ในอดีต กลับมามีความรู้สึกอีกครั้ง

        ตอนนี้ธรณินกล้าพูดได้อย่างเต็มปากเต็มคำว่า เด็กคนนี้คือ ‘ไออุ่น’ ในชีวิตเขา และเขา...ก็จะเป็นผืน ‘ดิน’ ที่มั่นคง คอยโอบอุ้มยามน้องเจ็บช้ำ จะไม่ให้น้องต้องอยู่อย่างโดดเดี่ยวอย่างที่เป็นมาอีกต่อไป',
        'price' => 305,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/126141/Thumbnail/book_detail_large.gif?2'
        ],
        ['id' => 8, 'name' => 'ชลาวิน [Mpreg]',
        'description' => 'เพราะความเข้าใจผิดทำให้ โชน ชาวิน รู้สึกเกลียดชัง เฌอ ชลาธร ตั้งแต่ยังไม่เคยพบหน้า

        ทว่าเพราะความเข้าใจผิดอย่างใหญ่หลวง ทำให้พวกเขาต้องมาใช้ชีวิตด้วยกันในฐานะเจ้านายกับลูกน้อง

        จนเกิดความสัมพันธ์อันคลุมเครือยากจะแยกแยะระหว่าง

        ความรักและความเกลียดชัง

        และบทสรุปของความเข้าใจผิดนี้จะลงเอยอย่างไร

        .......

        "เธอคงจะเป็นเฌอสินะ"

        "คะ...ครับ"

        "หน้าด้าน"

        "คุณชาวินครับเราเพิ่งเจอกันครั้งแรก ถึงคุณจะเข้าใจผมผิดก็ไม่เป็นไร แต่คุณจะมาหาเรื่องผมและตัดสินผมเพราะคำพูดของคนอื่นมันจะไม่เกินไปหน่อยเหรอ"

        "เกินไปงั้นเหรอ...ฉันเชื่อในสิ่งที่ตาฉันเห็น ชั้นสองเป็นห้องนอนของเจ้าบ้าน คนอาศัยแบบเธอไปอยู่ชั้นล่างน่าจะเหมาะกว่า แต่ถ้าจะให้ดีนอนรวมกับพวกคนรับใช้น่าจะดีที่สุด"',
        'price' => 159,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/296125/Thumbnail/book_detail_large.gif?5'
        ],
        ['id' => 9, 'name' => 'นิทานพันดาว',
        'description' => 'หากร้อยพันคำอธิษฐานที่ล่องลอยระยิบระยับในหมู่ดาว
        ...จะเป็นจริงสักครั้ง
        ฉันก็ขอภาวนาแค่ได้อยู่เคียงข้าง ‘เขา’ คนนั้นตลอดไป
        เพราะประโยคสุดท้ายในไดอารีสีหวานทำให้ ‘เธียร’ ตัดสินใจเดินทางไปเป็นครูอาสาบนดอยเพื่อทำตามคำขอสุดท้ายของ ‘เธอ’ ให้เป็นจริง ในโลกที่ไม่รู้จัก... เขาได้เรียนรู้ถึงคุณค่าในตัวเอง และการให้โดยไม่หวังสิ่งตอบแทน รวมถึงการได้เจอกับ ‘ร้อยเอกภูผา’
        ความใกล้ชิดก่อเกิดสายใยผูกพันท่ามกลางขุนเขาที่งดงามสุดเขตชายแดนประเทศ หัวใจ ของเธียรอัดแน่นไปด้วยความทรงจำที่มีต่อนายทหารร่างยักษ์จนเริ่มสับสนว่าความรู้สึกดีๆ เหล่านี้เป็นของเขาหรือของ ‘ใคร’ กันแน่?
        ความรักที่มีกาลเวลาเป็นเครื่องทดสอบช่างยากที่จะก้าวผ่าน หรือพวกเขาต้องอ้อนวอนต่อร้อยพันดวงดาวบนฟากฟ้าเพื่อให้คำสัญญาเพียงหนึ่งเดียวนี้เป็นจริง',
        'price' => 399,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/147550/Thumbnail/book_detail_large.gif?14'
        ],
        ['id' => 10, 'name' => 'KinnPorsche Story รักโคตรร้าย สุดท้ายโคตรรัก',
        'description' => 'เรื่องราวของครอบครัวมาเฟียผู้ยิ่งใหญ่ ‘ธีรปัญญากูร’ ที่มีการสืบทอดอำนาจจากรุ่นสู่รุ่นด้วยการปกครอง
        ของตระกูลหลัก (ผู้นำสูงสุด) และตระกูลรอง ร่องรอยความแตกแยก ชิงดีชิงเด่นเกิดขึ้นตั้งแต่อดีตจนถึงปัจจุบัน
        การปลูกฝังให้ทายาทแข็งแกร่งเพื่อยืนอยู่ในจุดสูงสุด จะต้องแกร่งแย่งและฟาดฟันกันมาด้วยความทรหด อดทน
        แลกด้วยความเป็นความตาย การล้างแค้นกันไปมาอย่างไม่มีที่สิ้นสุด

        พอร์ช หนุ่มนักศึกษาธรรมดาที่แบกความหวัง ความสุข ของน้องชายมาโดยลำพังทั้งชีวิตต้องจับพลัดจับพลูมาเป็นบอดี้การ์ดให้บ้านมาเฟียตระกูลหลักโดยไม่เต็มใจ และพอร์ชคิดว่าถึงคราวซวยที่เขาต้องมาอยู่ในบ้านหลังนี้ แต่จริงๆแล้วปมปริศนาที่พอร์ชเจอเบาะแสเรื่อยๆยิ่งทําให้เขาไม่สามารถไว้ใจใครได้ เพราะหลักฐานที่เจอล้วนเกี่ยวข้องกับความหลังและอดีตที่ฝังอยู่ในใจจนยากที่จะลบเลือน',
        'price' => 499,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/181205/Thumbnail/book_detail_large.gif?3'
        ],
        ['id' => 11, 'name' => 'หนูนาไม่ได้(รัก)​พี่พีชแล้ว (Mpreg)',
        'description' => 'อีกคนหนึ่ง​ รักจนหมดหัวใจ​ แต่อีกคนแค่แกล้งทำเป็นว่ารัก​ เพียงเพราะว่าอีกฝ่ายเกลียดพี่ชาย​ของเขา​ นาเดียร์​ต้องทนคบอีกฝ่ายเพราะคำว่ารักคำเดียว​ แม้อีกฝ่ายจะเลวทรามเพียงใด...แต่กลับยอมให้ชายหนุ่ม​ผู้เป็นที่รักได้ย่ำยี​จนหนำใจ​ แม้แต่วันที่จากลากัน​ ก็มีเพียงก้อนเนื้อที่เขาทิ้งไว้​ให้​ นั่นคือลูกที่เขาไม่ต้องการ​ แถมยังไล่ให้ไปตายพร้อมกันทั้งแม่ทั้งลูก',
        'price' => 189,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/247271/Thumbnail/book_detail_large.gif?13'
        ],
        ['id' => 12, 'name' => 'หนึ่งเดือนสุดท้ายก่อนตัวร้ายจะหายไปตลอดกาล',
        'description' => '"พาวิน"บังเอิญไปเจอหนังสือที่เขียนเรื่องราวความรักของชายสองคนและดันมีตนเองอยู่ในนั้น ในฐานะของตัวร้ายที่ทุกคนเกลียด พาวินไม่มีวันเชื่อจนกระทั่งอายุ 27 ปี เขาตรวจเจอมะเร็งระยะที่สี่อยู่ได้อีกไม่นาน สิ่งสุดท้ายที่ต้องการคือได้รับความรักจากคนรักที่เฝ้ารอมานานแสนนาน แต่สุดท้ายกลับได้รู้ความจริงที่ว่าพระเอกไม่เคยรักตัวเองเลย

        เขาคิดว่าที่ตัวเองโดดเดี่ยวแบบนี้มาจากการกระทำของตัวเอง เขาสมน้ำหน้าตัวเองที่พยายามมาตลอด พอเถอะ...

        ทุกอย่างเป็นไปตามที่หนังสือเขียน แต่เขามันโง่เองที่คิดว่าจะสามารถฝืนโชคชะตาได้แล้วครองรักกับพระเอกอย่าง"ราเชนทร์"ซ้ำยังถูกตราหน้าว่าเป็นคนเห็นแก่ตัวจากราชันคนที่เคยคิดว่าเข้าใจเขามากที่สุด',
        'price' => 179,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/297969/Thumbnail/book_detail_large.gif?6'
        ],
        ['id' => 13, 'name' => 'Cherry Magic! 30 ยังซิงกับเวทมนตร์ปิ๊งรัก',
        'description' => 'เพราะเป็นหนุ่มซิงจนกระทั่งอายุสามสิบ
        อาดาจิ คิโยชิจึงกลายเป็นผู้ใช้เวทมนตร์มีพลัง อ่านใจคนที่สัมผัสตัวได้
        อยู่มาวันหนึ่ง เขาดันบังเอิญไปโดนตัวคุโรซาวะ
        เพื่อนร่วมงานรุ่นเดียวกันที่ทั้งหล่อและทำงานเก่ง
        จนอ่านใจรู้ว่าเขาแอบหลงรักตัวเองเข้าเต็มเปา!?
        หนุ่มเวอร์จิ้นสุดทึ่มในวัยสามสิบจึงต้องมานั่งกลุ้มใจทำอะไรไม่ถูก
        และหวั่นไหว (?) กับความในใจของหนุ่มหล่อขวัญใจคนทั้งออฟฟิศ
        ที่ตัวเองเผลอไปล่วงรู้ความในใจอยู่เรื่อยๆ!',
        'price' => 150,
        'image'=> 'https://cdn-local.mebmarket.com/meb/server1/313108/Thumbnail/book_detail_large.gif?2'
        ],
    ];
    /**
     * Display a listing of the resource.
     */
    public function index()
    {
        //
        return Inertia::render('Products/Index', ['products' => $this->products]);
    }

    /**
     * Show the form for creating a new resource.
     */
    public function create()
    {
        //
    }

    /**
     * Store a newly created resource in storage.
     */
    public function store(Request $request)
    {
        //
    }

    /**
     * Display the specified resource.
     */
    public function show(string $id)
    {
        //
        $products = collect($this->products)->firstWhere('id',$id);

        if(!$products){
            abort(404, 'Product not found');
        }

        return Inertia::render('Products/Show', ['products' => $products]);
    }

    /**
     * Show the form for editing the specified resource.
     */
    public function edit(string $id)
    {
        //
    }

    /**
     * Update the specified resource in storage.
     */
    public function update(Request $request, string $id)
    {
        //
    }

    /**
     * Remove the specified resource from storage.
     */
    public function destroy(string $id)
    {
        //
    }
}
